aehoppe/E70N19_Dev_Board/atsame70n19/include/component/dacc.h
/**
 * \file
 *
 * \brief Component description for DACC
 *
 * Copyright (c) 2017 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

#ifndef _SAME70_DACC_COMPONENT_H_
#define _SAME70_DACC_COMPONENT_H_
#define _SAME70_DACC_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAME70_DACC Digital-to-Analog Converter Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR DACC */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define DACC_11246                      /**< (DACC) Module ID */
#define REV_DACC D                      /**< (DACC) Module revision */

/* -------- DACC_CR : (DACC Offset: 0x00) (/W 32) Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SWRST:1;                   /**< bit:      0  Software Reset                           */
    uint32_t :31;                       /**< bit:  1..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} DACC_CR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DACC_CR_OFFSET                      (0x00)                                        /**<  (DACC_CR) Control Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define DACC_CR_SWRST_Pos                   0                                              /**< (DACC_CR) Software Reset Position */
#define DACC_CR_SWRST_Msk                   (0x1U << DACC_CR_SWRST_Pos)                    /**< (DACC_CR) Software Reset Mask */
#define DACC_CR_SWRST                       DACC_CR_SWRST_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_CR_SWRST_Msk instead */
#define DACC_CR_MASK                        (0x01U)                                        /**< \deprecated (DACC_CR) Register MASK  (Use DACC_CR_Msk instead)  */
#define DACC_CR_Msk                         (0x01U)                                        /**< (DACC_CR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- DACC_MR : (DACC Offset: 0x04) (R/W 32) Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MAXS0:1;                   /**< bit:      0  Max Speed Mode for Channel 0             */
    uint32_t MAXS1:1;                   /**< bit:      1  Max Speed Mode for Channel 1             */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t WORD:1;                    /**< bit:      4  Word Transfer Mode                       */
    uint32_t ZERO:1;                    /**< bit:      5  Must always be written to 0.             */
    uint32_t :17;                       /**< bit:  6..22  Reserved */
    uint32_t DIFF:1;                    /**< bit:     23  Differential Mode                        */
    uint32_t PRESCALER:4;               /**< bit: 24..27  Peripheral Clock to DAC Clock Ratio      */
    uint32_t :4;                        /**< bit: 28..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} DACC_MR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DACC_MR_OFFSET                      (0x04)                                        /**<  (DACC_MR) Mode Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define DACC_MR_MAXS0_Pos                   0                                              /**< (DACC_MR) Max Speed Mode for Channel 0 Position */
#define DACC_MR_MAXS0_Msk                   (0x1U << DACC_MR_MAXS0_Pos)                    /**< (DACC_MR) Max Speed Mode for Channel 0 Mask */
#define DACC_MR_MAXS0                       DACC_MR_MAXS0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_MR_MAXS0_Msk instead */
#define   DACC_MR_MAXS0_TRIG_EVENT_Val      (0x0U)                                         /**< (DACC_MR) External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)  */
#define   DACC_MR_MAXS0_MAXIMUM_Val         (0x1U)                                         /**< (DACC_MR) Max speed mode enabled.  */
#define DACC_MR_MAXS0_TRIG_EVENT            (DACC_MR_MAXS0_TRIG_EVENT_Val << DACC_MR_MAXS0_Pos)  /**< (DACC_MR) External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.) Position  */
#define DACC_MR_MAXS0_MAXIMUM               (DACC_MR_MAXS0_MAXIMUM_Val << DACC_MR_MAXS0_Pos)  /**< (DACC_MR) Max speed mode enabled. Position  */
#define DACC_MR_MAXS1_Pos                   1                                              /**< (DACC_MR) Max Speed Mode for Channel 1 Position */
#define DACC_MR_MAXS1_Msk                   (0x1U << DACC_MR_MAXS1_Pos)                    /**< (DACC_MR) Max Speed Mode for Channel 1 Mask */
#define DACC_MR_MAXS1                       DACC_MR_MAXS1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_MR_MAXS1_Msk instead */
#define   DACC_MR_MAXS1_TRIG_EVENT_Val      (0x0U)                                         /**< (DACC_MR) External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)  */
#define   DACC_MR_MAXS1_MAXIMUM_Val         (0x1U)                                         /**< (DACC_MR) Max speed mode enabled.  */
#define DACC_MR_MAXS1_TRIG_EVENT            (DACC_MR_MAXS1_TRIG_EVENT_Val << DACC_MR_MAXS1_Pos)  /**< (DACC_MR) External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.) Position  */
#define DACC_MR_MAXS1_MAXIMUM               (DACC_MR_MAXS1_MAXIMUM_Val << DACC_MR_MAXS1_Pos)  /**< (DACC_MR) Max speed mode enabled. Position  */
#define DACC_MR_WORD_Pos                    4                                              /**< (DACC_MR) Word Transfer Mode Position */
#define DACC_MR_WORD_Msk                    (0x1U << DACC_MR_WORD_Pos)                     /**< (DACC_MR) Word Transfer Mode Mask */
#define DACC_MR_WORD                        DACC_MR_WORD_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_MR_WORD_Msk instead */
#define   DACC_MR_WORD_DISABLED_Val         (0x0U)                                         /**< (DACC_MR) One data to convert is written to the FIFO per access to DACC.  */
#define   DACC_MR_WORD_ENABLED_Val          (0x1U)                                         /**< (DACC_MR) Two data to convert are written to the FIFO per access to DACC (reduces the number of requests to DMA and the number of system bus accesses).  */
#define DACC_MR_WORD_DISABLED               (DACC_MR_WORD_DISABLED_Val << DACC_MR_WORD_Pos)  /**< (DACC_MR) One data to convert is written to the FIFO per access to DACC. Position  */
#define DACC_MR_WORD_ENABLED                (DACC_MR_WORD_ENABLED_Val << DACC_MR_WORD_Pos)  /**< (DACC_MR) Two data to convert are written to the FIFO per access to DACC (reduces the number of requests to DMA and the number of system bus accesses). Position  */
#define DACC_MR_ZERO_Pos                    5                                              /**< (DACC_MR) Must always be written to 0. Position */
#define DACC_MR_ZERO_Msk                    (0x1U << DACC_MR_ZERO_Pos)                     /**< (DACC_MR) Must always be written to 0. Mask */
#define DACC_MR_ZERO                        DACC_MR_ZERO_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_MR_ZERO_Msk instead */
#define DACC_MR_DIFF_Pos                    23                                             /**< (DACC_MR) Differential Mode Position */
#define DACC_MR_DIFF_Msk                    (0x1U << DACC_MR_DIFF_Pos)                     /**< (DACC_MR) Differential Mode Mask */
#define DACC_MR_DIFF                        DACC_MR_DIFF_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_MR_DIFF_Msk instead */
#define   DACC_MR_DIFF_DISABLED_Val         (0x0U)                                         /**< (DACC_MR) DAC0 and DAC1 are single-ended outputs.  */
#define   DACC_MR_DIFF_ENABLED_Val          (0x1U)                                         /**< (DACC_MR) DACP and DACN are differential outputs. The differential level is configured by the channel 0 value.  */
#define DACC_MR_DIFF_DISABLED               (DACC_MR_DIFF_DISABLED_Val << DACC_MR_DIFF_Pos)  /**< (DACC_MR) DAC0 and DAC1 are single-ended outputs. Position  */
#define DACC_MR_DIFF_ENABLED                (DACC_MR_DIFF_ENABLED_Val << DACC_MR_DIFF_Pos)  /**< (DACC_MR) DACP and DACN are differential outputs. The differential level is configured by the channel 0 value. Position  */
#define DACC_MR_PRESCALER_Pos               24                                             /**< (DACC_MR) Peripheral Clock to DAC Clock Ratio Position */
#define DACC_MR_PRESCALER_Msk               (0xFU << DACC_MR_PRESCALER_Pos)                /**< (DACC_MR) Peripheral Clock to DAC Clock Ratio Mask */
#define DACC_MR_PRESCALER(value)            (DACC_MR_PRESCALER_Msk & ((value) << DACC_MR_PRESCALER_Pos))
#define DACC_MR_MASK                        (0xF800033U)                                   /**< \deprecated (DACC_MR) Register MASK  (Use DACC_MR_Msk instead)  */
#define DACC_MR_Msk                         (0xF800033U)                                   /**< (DACC_MR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- DACC_TRIGR : (DACC Offset: 0x08) (R/W 32) Trigger Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TRGEN0:1;                  /**< bit:      0  Trigger Enable of Channel 0              */
    uint32_t TRGEN1:1;                  /**< bit:      1  Trigger Enable of Channel 1              */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t TRGSEL0:3;                 /**< bit:   4..6  Trigger Selection of Channel 0           */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t TRGSEL1:3;                 /**< bit:  8..10  Trigger Selection of Channel 1           */
    uint32_t :5;                        /**< bit: 11..15  Reserved */
    uint32_t OSR0:3;                    /**< bit: 16..18  Over Sampling Ratio of Channel 0         */
    uint32_t :1;                        /**< bit:     19  Reserved */
    uint32_t OSR1:3;                    /**< bit: 20..22  Over Sampling Ratio of Channel 1         */
    uint32_t :9;                        /**< bit: 23..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t TRGEN:2;                   /**< bit:   0..1  Trigger Enable of Channel x              */
    uint32_t :30;                       /**< bit:  2..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} DACC_TRIGR_Type;
