aehoppe/E70N19_Dev_Board/atsame70n19/include/component/dacc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DACC_TRIGR_OFFSET                   (0x08)                                        /**<  (DACC_TRIGR) Trigger Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define DACC_TRIGR_TRGEN0_Pos               0                                              /**< (DACC_TRIGR) Trigger Enable of Channel 0 Position */
#define DACC_TRIGR_TRGEN0_Msk               (0x1U << DACC_TRIGR_TRGEN0_Pos)                /**< (DACC_TRIGR) Trigger Enable of Channel 0 Mask */
#define DACC_TRIGR_TRGEN0                   DACC_TRIGR_TRGEN0_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_TRIGR_TRGEN0_Msk instead */
#define   DACC_TRIGR_TRGEN0_DIS_Val         (0x0U)                                         /**< (DACC_TRIGR) External trigger mode disabled. DACC is in Free-running mode or Max speed mode.  */
#define   DACC_TRIGR_TRGEN0_EN_Val          (0x1U)                                         /**< (DACC_TRIGR) External trigger mode enabled.  */
#define DACC_TRIGR_TRGEN0_DIS               (DACC_TRIGR_TRGEN0_DIS_Val << DACC_TRIGR_TRGEN0_Pos)  /**< (DACC_TRIGR) External trigger mode disabled. DACC is in Free-running mode or Max speed mode. Position  */
#define DACC_TRIGR_TRGEN0_EN                (DACC_TRIGR_TRGEN0_EN_Val << DACC_TRIGR_TRGEN0_Pos)  /**< (DACC_TRIGR) External trigger mode enabled. Position  */
#define DACC_TRIGR_TRGEN1_Pos               1                                              /**< (DACC_TRIGR) Trigger Enable of Channel 1 Position */
#define DACC_TRIGR_TRGEN1_Msk               (0x1U << DACC_TRIGR_TRGEN1_Pos)                /**< (DACC_TRIGR) Trigger Enable of Channel 1 Mask */
#define DACC_TRIGR_TRGEN1                   DACC_TRIGR_TRGEN1_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_TRIGR_TRGEN1_Msk instead */
#define   DACC_TRIGR_TRGEN1_DIS_Val         (0x0U)                                         /**< (DACC_TRIGR) External trigger mode disabled. DACC is in Free-running mode or Max speed mode.  */
#define   DACC_TRIGR_TRGEN1_EN_Val          (0x1U)                                         /**< (DACC_TRIGR) External trigger mode enabled.  */
#define DACC_TRIGR_TRGEN1_DIS               (DACC_TRIGR_TRGEN1_DIS_Val << DACC_TRIGR_TRGEN1_Pos)  /**< (DACC_TRIGR) External trigger mode disabled. DACC is in Free-running mode or Max speed mode. Position  */
#define DACC_TRIGR_TRGEN1_EN                (DACC_TRIGR_TRGEN1_EN_Val << DACC_TRIGR_TRGEN1_Pos)  /**< (DACC_TRIGR) External trigger mode enabled. Position  */
#define DACC_TRIGR_TRGSEL0_Pos              4                                              /**< (DACC_TRIGR) Trigger Selection of Channel 0 Position */
#define DACC_TRIGR_TRGSEL0_Msk              (0x7U << DACC_TRIGR_TRGSEL0_Pos)               /**< (DACC_TRIGR) Trigger Selection of Channel 0 Mask */
#define DACC_TRIGR_TRGSEL0(value)           (DACC_TRIGR_TRGSEL0_Msk & ((value) << DACC_TRIGR_TRGSEL0_Pos))
#define   DACC_TRIGR_TRGSEL0_TRGSEL0_Val    (0x0U)                                         /**< (DACC_TRIGR) DATRG  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL1_Val    (0x1U)                                         /**< (DACC_TRIGR) TC0 output  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL2_Val    (0x2U)                                         /**< (DACC_TRIGR) TC1 output  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL3_Val    (0x3U)                                         /**< (DACC_TRIGR) TC2 output  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL4_Val    (0x4U)                                         /**< (DACC_TRIGR) PWM0 event 0  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL5_Val    (0x5U)                                         /**< (DACC_TRIGR) PWM0 event 1  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL6_Val    (0x6U)                                         /**< (DACC_TRIGR) PWM1 event 0  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL7_Val    (0x7U)                                         /**< (DACC_TRIGR) PWM1 event 1  */
#define DACC_TRIGR_TRGSEL0_TRGSEL0          (DACC_TRIGR_TRGSEL0_TRGSEL0_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) DATRG Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL1          (DACC_TRIGR_TRGSEL0_TRGSEL1_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) TC0 output Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL2          (DACC_TRIGR_TRGSEL0_TRGSEL2_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) TC1 output Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL3          (DACC_TRIGR_TRGSEL0_TRGSEL3_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) TC2 output Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL4          (DACC_TRIGR_TRGSEL0_TRGSEL4_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) PWM0 event 0 Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL5          (DACC_TRIGR_TRGSEL0_TRGSEL5_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) PWM0 event 1 Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL6          (DACC_TRIGR_TRGSEL0_TRGSEL6_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) PWM1 event 0 Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL7          (DACC_TRIGR_TRGSEL0_TRGSEL7_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) PWM1 event 1 Position  */
#define DACC_TRIGR_TRGSEL1_Pos              8                                              /**< (DACC_TRIGR) Trigger Selection of Channel 1 Position */
#define DACC_TRIGR_TRGSEL1_Msk              (0x7U << DACC_TRIGR_TRGSEL1_Pos)               /**< (DACC_TRIGR) Trigger Selection of Channel 1 Mask */
#define DACC_TRIGR_TRGSEL1(value)           (DACC_TRIGR_TRGSEL1_Msk & ((value) << DACC_TRIGR_TRGSEL1_Pos))
#define   DACC_TRIGR_TRGSEL1_TRGSEL0_Val    (0x0U)                                         /**< (DACC_TRIGR) DATRG  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL1_Val    (0x1U)                                         /**< (DACC_TRIGR) TC0 output  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL2_Val    (0x2U)                                         /**< (DACC_TRIGR) TC1 output  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL3_Val    (0x3U)                                         /**< (DACC_TRIGR) TC2 output  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL4_Val    (0x4U)                                         /**< (DACC_TRIGR) PWM0 event 0  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL5_Val    (0x5U)                                         /**< (DACC_TRIGR) PWM0 event 1  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL6_Val    (0x6U)                                         /**< (DACC_TRIGR) PWM1 event 0  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL7_Val    (0x7U)                                         /**< (DACC_TRIGR) PWM1 event 1  */
#define DACC_TRIGR_TRGSEL1_TRGSEL0          (DACC_TRIGR_TRGSEL1_TRGSEL0_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) DATRG Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL1          (DACC_TRIGR_TRGSEL1_TRGSEL1_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) TC0 output Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL2          (DACC_TRIGR_TRGSEL1_TRGSEL2_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) TC1 output Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL3          (DACC_TRIGR_TRGSEL1_TRGSEL3_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) TC2 output Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL4          (DACC_TRIGR_TRGSEL1_TRGSEL4_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) PWM0 event 0 Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL5          (DACC_TRIGR_TRGSEL1_TRGSEL5_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) PWM0 event 1 Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL6          (DACC_TRIGR_TRGSEL1_TRGSEL6_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) PWM1 event 0 Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL7          (DACC_TRIGR_TRGSEL1_TRGSEL7_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) PWM1 event 1 Position  */
#define DACC_TRIGR_OSR0_Pos                 16                                             /**< (DACC_TRIGR) Over Sampling Ratio of Channel 0 Position */
#define DACC_TRIGR_OSR0_Msk                 (0x7U << DACC_TRIGR_OSR0_Pos)                  /**< (DACC_TRIGR) Over Sampling Ratio of Channel 0 Mask */
#define DACC_TRIGR_OSR0(value)              (DACC_TRIGR_OSR0_Msk & ((value) << DACC_TRIGR_OSR0_Pos))
#define   DACC_TRIGR_OSR0_OSR_1_Val         (0x0U)                                         /**< (DACC_TRIGR) OSR = 1  */
#define   DACC_TRIGR_OSR0_OSR_2_Val         (0x1U)                                         /**< (DACC_TRIGR) OSR = 2  */
#define   DACC_TRIGR_OSR0_OSR_4_Val         (0x2U)                                         /**< (DACC_TRIGR) OSR = 4  */
#define   DACC_TRIGR_OSR0_OSR_8_Val         (0x3U)                                         /**< (DACC_TRIGR) OSR = 8  */
#define   DACC_TRIGR_OSR0_OSR_16_Val        (0x4U)                                         /**< (DACC_TRIGR) OSR = 16  */
#define   DACC_TRIGR_OSR0_OSR_32_Val        (0x5U)                                         /**< (DACC_TRIGR) OSR = 32  */
#define DACC_TRIGR_OSR0_OSR_1               (DACC_TRIGR_OSR0_OSR_1_Val << DACC_TRIGR_OSR0_Pos)  /**< (DACC_TRIGR) OSR = 1 Position  */
#define DACC_TRIGR_OSR0_OSR_2               (DACC_TRIGR_OSR0_OSR_2_Val << DACC_TRIGR_OSR0_Pos)  /**< (DACC_TRIGR) OSR = 2 Position  */
#define DACC_TRIGR_OSR0_OSR_4               (DACC_TRIGR_OSR0_OSR_4_Val << DACC_TRIGR_OSR0_Pos)  /**< (DACC_TRIGR) OSR = 4 Position  */
#define DACC_TRIGR_OSR0_OSR_8               (DACC_TRIGR_OSR0_OSR_8_Val << DACC_TRIGR_OSR0_Pos)  /**< (DACC_TRIGR) OSR = 8 Position  */
#define DACC_TRIGR_OSR0_OSR_16              (DACC_TRIGR_OSR0_OSR_16_Val << DACC_TRIGR_OSR0_Pos)  /**< (DACC_TRIGR) OSR = 16 Position  */
#define DACC_TRIGR_OSR0_OSR_32              (DACC_TRIGR_OSR0_OSR_32_Val << DACC_TRIGR_OSR0_Pos)  /**< (DACC_TRIGR) OSR = 32 Position  */
#define DACC_TRIGR_OSR1_Pos                 20                                             /**< (DACC_TRIGR) Over Sampling Ratio of Channel 1 Position */
#define DACC_TRIGR_OSR1_Msk                 (0x7U << DACC_TRIGR_OSR1_Pos)                  /**< (DACC_TRIGR) Over Sampling Ratio of Channel 1 Mask */
#define DACC_TRIGR_OSR1(value)              (DACC_TRIGR_OSR1_Msk & ((value) << DACC_TRIGR_OSR1_Pos))
#define   DACC_TRIGR_OSR1_OSR_1_Val         (0x0U)                                         /**< (DACC_TRIGR) OSR = 1  */
#define   DACC_TRIGR_OSR1_OSR_2_Val         (0x1U)                                         /**< (DACC_TRIGR) OSR = 2  */
#define   DACC_TRIGR_OSR1_OSR_4_Val         (0x2U)                                         /**< (DACC_TRIGR) OSR = 4  */
#define   DACC_TRIGR_OSR1_OSR_8_Val         (0x3U)                                         /**< (DACC_TRIGR) OSR = 8  */
#define   DACC_TRIGR_OSR1_OSR_16_Val        (0x4U)                                         /**< (DACC_TRIGR) OSR = 16  */
#define   DACC_TRIGR_OSR1_OSR_32_Val        (0x5U)                                         /**< (DACC_TRIGR) OSR = 32  */
#define DACC_TRIGR_OSR1_OSR_1               (DACC_TRIGR_OSR1_OSR_1_Val << DACC_TRIGR_OSR1_Pos)  /**< (DACC_TRIGR) OSR = 1 Position  */
#define DACC_TRIGR_OSR1_OSR_2               (DACC_TRIGR_OSR1_OSR_2_Val << DACC_TRIGR_OSR1_Pos)  /**< (DACC_TRIGR) OSR = 2 Position  */
#define DACC_TRIGR_OSR1_OSR_4               (DACC_TRIGR_OSR1_OSR_4_Val << DACC_TRIGR_OSR1_Pos)  /**< (DACC_TRIGR) OSR = 4 Position  */
#define DACC_TRIGR_OSR1_OSR_8               (DACC_TRIGR_OSR1_OSR_8_Val << DACC_TRIGR_OSR1_Pos)  /**< (DACC_TRIGR) OSR = 8 Position  */
#define DACC_TRIGR_OSR1_OSR_16              (DACC_TRIGR_OSR1_OSR_16_Val << DACC_TRIGR_OSR1_Pos)  /**< (DACC_TRIGR) OSR = 16 Position  */
#define DACC_TRIGR_OSR1_OSR_32              (DACC_TRIGR_OSR1_OSR_32_Val << DACC_TRIGR_OSR1_Pos)  /**< (DACC_TRIGR) OSR = 32 Position  */
#define DACC_TRIGR_TRGEN_Pos                0                                              /**< (DACC_TRIGR Position) Trigger Enable of Channel x */
#define DACC_TRIGR_TRGEN_Msk                (0x3U << DACC_TRIGR_TRGEN_Pos)                 /**< (DACC_TRIGR Mask) TRGEN */
#define DACC_TRIGR_TRGEN(value)             (DACC_TRIGR_TRGEN_Msk & ((value) << DACC_TRIGR_TRGEN_Pos))  
#define DACC_TRIGR_MASK                     (0x770773U)                                    /**< \deprecated (DACC_TRIGR) Register MASK  (Use DACC_TRIGR_Msk instead)  */
#define DACC_TRIGR_Msk                      (0x770773U)                                    /**< (DACC_TRIGR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


