aehoppe/E70N19_Dev_Board/atsame70n19/include/component/dacc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DACC_IER_OFFSET                     (0x24)                                        /**<  (DACC_IER) Interrupt Enable Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define DACC_IER_TXRDY0_Pos                 0                                              /**< (DACC_IER) Transmit Ready Interrupt Enable of channel 0 Position */
#define DACC_IER_TXRDY0_Msk                 (0x1U << DACC_IER_TXRDY0_Pos)                  /**< (DACC_IER) Transmit Ready Interrupt Enable of channel 0 Mask */
#define DACC_IER_TXRDY0                     DACC_IER_TXRDY0_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_IER_TXRDY0_Msk instead */
#define DACC_IER_TXRDY1_Pos                 1                                              /**< (DACC_IER) Transmit Ready Interrupt Enable of channel 1 Position */
#define DACC_IER_TXRDY1_Msk                 (0x1U << DACC_IER_TXRDY1_Pos)                  /**< (DACC_IER) Transmit Ready Interrupt Enable of channel 1 Mask */
#define DACC_IER_TXRDY1                     DACC_IER_TXRDY1_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_IER_TXRDY1_Msk instead */
#define DACC_IER_EOC0_Pos                   4                                              /**< (DACC_IER) End of Conversion Interrupt Enable of channel 0 Position */
#define DACC_IER_EOC0_Msk                   (0x1U << DACC_IER_EOC0_Pos)                    /**< (DACC_IER) End of Conversion Interrupt Enable of channel 0 Mask */
#define DACC_IER_EOC0                       DACC_IER_EOC0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_IER_EOC0_Msk instead */
#define DACC_IER_EOC1_Pos                   5                                              /**< (DACC_IER) End of Conversion Interrupt Enable of channel 1 Position */
#define DACC_IER_EOC1_Msk                   (0x1U << DACC_IER_EOC1_Pos)                    /**< (DACC_IER) End of Conversion Interrupt Enable of channel 1 Mask */
#define DACC_IER_EOC1                       DACC_IER_EOC1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_IER_EOC1_Msk instead */
#define DACC_IER_TXRDY_Pos                  0                                              /**< (DACC_IER Position) Transmit Ready Interrupt Enable of channel x */
#define DACC_IER_TXRDY_Msk                  (0x3U << DACC_IER_TXRDY_Pos)                   /**< (DACC_IER Mask) TXRDY */
#define DACC_IER_TXRDY(value)               (DACC_IER_TXRDY_Msk & ((value) << DACC_IER_TXRDY_Pos))  
#define DACC_IER_EOC_Pos                    4                                              /**< (DACC_IER Position) End of Conversion Interrupt Enable of channel x */
#define DACC_IER_EOC_Msk                    (0x3U << DACC_IER_EOC_Pos)                     /**< (DACC_IER Mask) EOC */
#define DACC_IER_EOC(value)                 (DACC_IER_EOC_Msk & ((value) << DACC_IER_EOC_Pos))  
#define DACC_IER_MASK                       (0x33U)                                        /**< \deprecated (DACC_IER) Register MASK  (Use DACC_IER_Msk instead)  */
#define DACC_IER_Msk                        (0x33U)                                        /**< (DACC_IER) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- DACC_IDR : (DACC Offset: 0x28) (/W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXRDY0:1;                  /**< bit:      0  Transmit Ready Interrupt Disable of channel 0 */
    uint32_t TXRDY1:1;                  /**< bit:      1  Transmit Ready Interrupt Disable of channel 1 */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t EOC0:1;                    /**< bit:      4  End of Conversion Interrupt Disable of channel 0 */
    uint32_t EOC1:1;                    /**< bit:      5  End of Conversion Interrupt Disable of channel 1 */
    uint32_t :26;                       /**< bit:  6..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t TXRDY:2;                   /**< bit:   0..1  Transmit Ready Interrupt Disable of channel x */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t EOC:2;                     /**< bit:   4..5  End of Conversion Interrupt Disable of channel x */
    uint32_t :26;                       /**< bit:  6..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} DACC_IDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DACC_IDR_OFFSET                     (0x28)                                        /**<  (DACC_IDR) Interrupt Disable Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define DACC_IDR_TXRDY0_Pos                 0                                              /**< (DACC_IDR) Transmit Ready Interrupt Disable of channel 0 Position */
#define DACC_IDR_TXRDY0_Msk                 (0x1U << DACC_IDR_TXRDY0_Pos)                  /**< (DACC_IDR) Transmit Ready Interrupt Disable of channel 0 Mask */
#define DACC_IDR_TXRDY0                     DACC_IDR_TXRDY0_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_IDR_TXRDY0_Msk instead */
#define DACC_IDR_TXRDY1_Pos                 1                                              /**< (DACC_IDR) Transmit Ready Interrupt Disable of channel 1 Position */
#define DACC_IDR_TXRDY1_Msk                 (0x1U << DACC_IDR_TXRDY1_Pos)                  /**< (DACC_IDR) Transmit Ready Interrupt Disable of channel 1 Mask */
#define DACC_IDR_TXRDY1                     DACC_IDR_TXRDY1_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_IDR_TXRDY1_Msk instead */
#define DACC_IDR_EOC0_Pos                   4                                              /**< (DACC_IDR) End of Conversion Interrupt Disable of channel 0 Position */
#define DACC_IDR_EOC0_Msk                   (0x1U << DACC_IDR_EOC0_Pos)                    /**< (DACC_IDR) End of Conversion Interrupt Disable of channel 0 Mask */
#define DACC_IDR_EOC0                       DACC_IDR_EOC0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_IDR_EOC0_Msk instead */
#define DACC_IDR_EOC1_Pos                   5                                              /**< (DACC_IDR) End of Conversion Interrupt Disable of channel 1 Position */
#define DACC_IDR_EOC1_Msk                   (0x1U << DACC_IDR_EOC1_Pos)                    /**< (DACC_IDR) End of Conversion Interrupt Disable of channel 1 Mask */
#define DACC_IDR_EOC1                       DACC_IDR_EOC1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_IDR_EOC1_Msk instead */
#define DACC_IDR_TXRDY_Pos                  0                                              /**< (DACC_IDR Position) Transmit Ready Interrupt Disable of channel x */
#define DACC_IDR_TXRDY_Msk                  (0x3U << DACC_IDR_TXRDY_Pos)                   /**< (DACC_IDR Mask) TXRDY */
#define DACC_IDR_TXRDY(value)               (DACC_IDR_TXRDY_Msk & ((value) << DACC_IDR_TXRDY_Pos))  
#define DACC_IDR_EOC_Pos                    4                                              /**< (DACC_IDR Position) End of Conversion Interrupt Disable of channel x */
#define DACC_IDR_EOC_Msk                    (0x3U << DACC_IDR_EOC_Pos)                     /**< (DACC_IDR Mask) EOC */
#define DACC_IDR_EOC(value)                 (DACC_IDR_EOC_Msk & ((value) << DACC_IDR_EOC_Pos))  
#define DACC_IDR_MASK                       (0x33U)                                        /**< \deprecated (DACC_IDR) Register MASK  (Use DACC_IDR_Msk instead)  */
#define DACC_IDR_Msk                        (0x33U)                                        /**< (DACC_IDR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- DACC_IMR : (DACC Offset: 0x2c) (R/ 32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXRDY0:1;                  /**< bit:      0  Transmit Ready Interrupt Mask of channel 0 */
    uint32_t TXRDY1:1;                  /**< bit:      1  Transmit Ready Interrupt Mask of channel 1 */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t EOC0:1;                    /**< bit:      4  End of Conversion Interrupt Mask of channel 0 */
    uint32_t EOC1:1;                    /**< bit:      5  End of Conversion Interrupt Mask of channel 1 */
    uint32_t :26;                       /**< bit:  6..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t TXRDY:2;                   /**< bit:   0..1  Transmit Ready Interrupt Mask of channel x */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t EOC:2;                     /**< bit:   4..5  End of Conversion Interrupt Mask of channel x */
    uint32_t :26;                       /**< bit:  6..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} DACC_IMR_Type;
