aehoppe/E70N19_Dev_Board/atsame70n19/include/component/dacc.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DACC_IMR_OFFSET                     (0x2C)                                        /**<  (DACC_IMR) Interrupt Mask Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define DACC_IMR_TXRDY0_Pos                 0                                              /**< (DACC_IMR) Transmit Ready Interrupt Mask of channel 0 Position */
#define DACC_IMR_TXRDY0_Msk                 (0x1U << DACC_IMR_TXRDY0_Pos)                  /**< (DACC_IMR) Transmit Ready Interrupt Mask of channel 0 Mask */
#define DACC_IMR_TXRDY0                     DACC_IMR_TXRDY0_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_IMR_TXRDY0_Msk instead */
#define DACC_IMR_TXRDY1_Pos                 1                                              /**< (DACC_IMR) Transmit Ready Interrupt Mask of channel 1 Position */
#define DACC_IMR_TXRDY1_Msk                 (0x1U << DACC_IMR_TXRDY1_Pos)                  /**< (DACC_IMR) Transmit Ready Interrupt Mask of channel 1 Mask */
#define DACC_IMR_TXRDY1                     DACC_IMR_TXRDY1_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_IMR_TXRDY1_Msk instead */
#define DACC_IMR_EOC0_Pos                   4                                              /**< (DACC_IMR) End of Conversion Interrupt Mask of channel 0 Position */
#define DACC_IMR_EOC0_Msk                   (0x1U << DACC_IMR_EOC0_Pos)                    /**< (DACC_IMR) End of Conversion Interrupt Mask of channel 0 Mask */
#define DACC_IMR_EOC0                       DACC_IMR_EOC0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_IMR_EOC0_Msk instead */
#define DACC_IMR_EOC1_Pos                   5                                              /**< (DACC_IMR) End of Conversion Interrupt Mask of channel 1 Position */
#define DACC_IMR_EOC1_Msk                   (0x1U << DACC_IMR_EOC1_Pos)                    /**< (DACC_IMR) End of Conversion Interrupt Mask of channel 1 Mask */
#define DACC_IMR_EOC1                       DACC_IMR_EOC1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_IMR_EOC1_Msk instead */
#define DACC_IMR_TXRDY_Pos                  0                                              /**< (DACC_IMR Position) Transmit Ready Interrupt Mask of channel x */
#define DACC_IMR_TXRDY_Msk                  (0x3U << DACC_IMR_TXRDY_Pos)                   /**< (DACC_IMR Mask) TXRDY */
#define DACC_IMR_TXRDY(value)               (DACC_IMR_TXRDY_Msk & ((value) << DACC_IMR_TXRDY_Pos))  
#define DACC_IMR_EOC_Pos                    4                                              /**< (DACC_IMR Position) End of Conversion Interrupt Mask of channel x */
#define DACC_IMR_EOC_Msk                    (0x3U << DACC_IMR_EOC_Pos)                     /**< (DACC_IMR Mask) EOC */
#define DACC_IMR_EOC(value)                 (DACC_IMR_EOC_Msk & ((value) << DACC_IMR_EOC_Pos))  
#define DACC_IMR_MASK                       (0x33U)                                        /**< \deprecated (DACC_IMR) Register MASK  (Use DACC_IMR_Msk instead)  */
#define DACC_IMR_Msk                        (0x33U)                                        /**< (DACC_IMR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- DACC_ISR : (DACC Offset: 0x30) (R/ 32) Interrupt Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXRDY0:1;                  /**< bit:      0  Transmit Ready Interrupt Flag of channel 0 */
    uint32_t TXRDY1:1;                  /**< bit:      1  Transmit Ready Interrupt Flag of channel 1 */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t EOC0:1;                    /**< bit:      4  End of Conversion Interrupt Flag of channel 0 */
    uint32_t EOC1:1;                    /**< bit:      5  End of Conversion Interrupt Flag of channel 1 */
    uint32_t :26;                       /**< bit:  6..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t TXRDY:2;                   /**< bit:   0..1  Transmit Ready Interrupt Flag of channel x */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t EOC:2;                     /**< bit:   4..5  End of Conversion Interrupt Flag of channel x */
    uint32_t :26;                       /**< bit:  6..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} DACC_ISR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DACC_ISR_OFFSET                     (0x30)                                        /**<  (DACC_ISR) Interrupt Status Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define DACC_ISR_TXRDY0_Pos                 0                                              /**< (DACC_ISR) Transmit Ready Interrupt Flag of channel 0 Position */
#define DACC_ISR_TXRDY0_Msk                 (0x1U << DACC_ISR_TXRDY0_Pos)                  /**< (DACC_ISR) Transmit Ready Interrupt Flag of channel 0 Mask */
#define DACC_ISR_TXRDY0                     DACC_ISR_TXRDY0_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_ISR_TXRDY0_Msk instead */
#define DACC_ISR_TXRDY1_Pos                 1                                              /**< (DACC_ISR) Transmit Ready Interrupt Flag of channel 1 Position */
#define DACC_ISR_TXRDY1_Msk                 (0x1U << DACC_ISR_TXRDY1_Pos)                  /**< (DACC_ISR) Transmit Ready Interrupt Flag of channel 1 Mask */
#define DACC_ISR_TXRDY1                     DACC_ISR_TXRDY1_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_ISR_TXRDY1_Msk instead */
#define DACC_ISR_EOC0_Pos                   4                                              /**< (DACC_ISR) End of Conversion Interrupt Flag of channel 0 Position */
#define DACC_ISR_EOC0_Msk                   (0x1U << DACC_ISR_EOC0_Pos)                    /**< (DACC_ISR) End of Conversion Interrupt Flag of channel 0 Mask */
#define DACC_ISR_EOC0                       DACC_ISR_EOC0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_ISR_EOC0_Msk instead */
#define DACC_ISR_EOC1_Pos                   5                                              /**< (DACC_ISR) End of Conversion Interrupt Flag of channel 1 Position */
#define DACC_ISR_EOC1_Msk                   (0x1U << DACC_ISR_EOC1_Pos)                    /**< (DACC_ISR) End of Conversion Interrupt Flag of channel 1 Mask */
#define DACC_ISR_EOC1                       DACC_ISR_EOC1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use DACC_ISR_EOC1_Msk instead */
#define DACC_ISR_TXRDY_Pos                  0                                              /**< (DACC_ISR Position) Transmit Ready Interrupt Flag of channel x */
#define DACC_ISR_TXRDY_Msk                  (0x3U << DACC_ISR_TXRDY_Pos)                   /**< (DACC_ISR Mask) TXRDY */
#define DACC_ISR_TXRDY(value)               (DACC_ISR_TXRDY_Msk & ((value) << DACC_ISR_TXRDY_Pos))  
#define DACC_ISR_EOC_Pos                    4                                              /**< (DACC_ISR Position) End of Conversion Interrupt Flag of channel x */
#define DACC_ISR_EOC_Msk                    (0x3U << DACC_ISR_EOC_Pos)                     /**< (DACC_ISR Mask) EOC */
#define DACC_ISR_EOC(value)                 (DACC_ISR_EOC_Msk & ((value) << DACC_ISR_EOC_Pos))  
#define DACC_ISR_MASK                       (0x33U)                                        /**< \deprecated (DACC_ISR) Register MASK  (Use DACC_ISR_Msk instead)  */
#define DACC_ISR_Msk                        (0x33U)                                        /**< (DACC_ISR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- DACC_ACR : (DACC Offset: 0x94) (R/W 32) Analog Current Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t IBCTLCH0:2;                /**< bit:   0..1  Analog Output Current Control            */
    uint32_t IBCTLCH1:2;                /**< bit:   2..3  Analog Output Current Control            */
    uint32_t :28;                       /**< bit:  4..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} DACC_ACR_Type;
