aehoppe/E70N19_Dev_Board/atsame70n19/include/component/dacc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief DACC hardware registers */
typedef struct {  
  __O  uint32_t DACC_CR;        /**< (DACC Offset: 0x00) Control Register */
  __IO uint32_t DACC_MR;        /**< (DACC Offset: 0x04) Mode Register */
  __IO uint32_t DACC_TRIGR;     /**< (DACC Offset: 0x08) Trigger Register */
  __I  uint32_t Reserved1[1];
  __O  uint32_t DACC_CHER;      /**< (DACC Offset: 0x10) Channel Enable Register */
  __O  uint32_t DACC_CHDR;      /**< (DACC Offset: 0x14) Channel Disable Register */
  __I  uint32_t DACC_CHSR;      /**< (DACC Offset: 0x18) Channel Status Register */
  __O  uint32_t DACC_CDR[2];    /**< (DACC Offset: 0x1C) Conversion Data Register 0 */
  __O  uint32_t DACC_IER;       /**< (DACC Offset: 0x24) Interrupt Enable Register */
  __O  uint32_t DACC_IDR;       /**< (DACC Offset: 0x28) Interrupt Disable Register */
  __I  uint32_t DACC_IMR;       /**< (DACC Offset: 0x2C) Interrupt Mask Register */
  __I  uint32_t DACC_ISR;       /**< (DACC Offset: 0x30) Interrupt Status Register */
  __I  uint32_t Reserved2[24];
  __IO uint32_t DACC_ACR;       /**< (DACC Offset: 0x94) Analog Current Register */
  __I  uint32_t Reserved3[19];
  __IO uint32_t DACC_WPMR;      /**< (DACC Offset: 0xE4) Write Protection Mode Register */
  __I  uint32_t DACC_WPSR;      /**< (DACC Offset: 0xE8) Write Protection Status Register */
} Dacc;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief DACC hardware registers */
typedef struct {  
  __O  DACC_CR_Type                   DACC_CR;        /**< Offset: 0x00 ( /W  32) Control Register */
  __IO DACC_MR_Type                   DACC_MR;        /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO DACC_TRIGR_Type                DACC_TRIGR;     /**< Offset: 0x08 (R/W  32) Trigger Register */
       RoReg8                         Reserved1[0x4];
  __O  DACC_CHER_Type                 DACC_CHER;      /**< Offset: 0x10 ( /W  32) Channel Enable Register */
  __O  DACC_CHDR_Type                 DACC_CHDR;      /**< Offset: 0x14 ( /W  32) Channel Disable Register */
  __I  DACC_CHSR_Type                 DACC_CHSR;      /**< Offset: 0x18 (R/   32) Channel Status Register */
  __O  DACC_CDR_Type                  DACC_CDR[2];    /**< Offset: 0x1C ( /W  32) Conversion Data Register 0 */
  __O  DACC_IER_Type                  DACC_IER;       /**< Offset: 0x24 ( /W  32) Interrupt Enable Register */
  __O  DACC_IDR_Type                  DACC_IDR;       /**< Offset: 0x28 ( /W  32) Interrupt Disable Register */
  __I  DACC_IMR_Type                  DACC_IMR;       /**< Offset: 0x2C (R/   32) Interrupt Mask Register */
  __I  DACC_ISR_Type                  DACC_ISR;       /**< Offset: 0x30 (R/   32) Interrupt Status Register */
       RoReg8                         Reserved2[0x60];
  __IO DACC_ACR_Type                  DACC_ACR;       /**< Offset: 0x94 (R/W  32) Analog Current Register */
       RoReg8                         Reserved3[0x4C];
  __IO DACC_WPMR_Type                 DACC_WPMR;      /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I  DACC_WPSR_Type                 DACC_WPSR;      /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} Dacc;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/** @}  end of Digital-to-Analog Converter Controller */

#endif /* _SAME70_DACC_COMPONENT_H_ */
